# Стартовая страница
site = "https://stellarburgers.nomoreparties.site/"

# Переменные
# Пароль для восстановления
password_for_recovery = '12345678'
# Значение по умолчанию при оформления заказа
default_number = '9999'


# Ожидаемый результат
# Тесты базовый функционал
# Переход по клику на «Конструктор» и Всплывающее окно закрыть кликом по крестику
text_assemble_burger = 'Соберите бургер'
# Переход по клику на «Лента заказов»
text_order_feed = 'Лента заказов'
# Всплывающее окно с деталями
text_ingredient_details = 'Детали ингредиента'
# Счётчик ингридиента увеличивается
counter = '2'
# Залогиненный пользователь может оформить заказ
text_order_being_prepared = 'Ваш заказ начали готовить'

# Тесты восстановления пароля
# Переход на страницу восстановления пароля по кнопке «Восстановить пароль»
text_password_recovery = 'Восстановление пароля'
# Ввод почты и клик по кнопке «Восстановить»
text_save = 'Сохранить'
# Клик по кнопке показать/скрыть пароль делает поле активным — подсвечивает его
text_password = 'Пароль'

# Тесты личный кабинет
# Переход в «Личный кабинет» и Выход из аккаунта
text_entrance = 'Вход'
# Переход в раздел «История заказов»
text_history_orders = 'История заказов'

# Тесты лента заказов
# Всплывающее окно с деталями заказа
text_composition = 'Cостав'
